{"architecture":{"class_name":"Functional","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"batch_input_shape":[null,16],"dtype":"float32","units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L2","config":{"l2":0.009999999776482582}},"bias_regularizer":null,"activity_regularizer":{"class_name":"L2","config":{"l2":0.009999999776482582}},"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":6,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_1",0,0]]},"keras_version":"2.8.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[16]],"output_shapes":[[6]],"tests":[{"inputs":[{"shape":[16],"values":["jm9gP822HMDD47E/6rK2vhuTTj+hcmS9mBbhvCIskr8U9tW/n6Xwve2t1T0ykj29W3zNvSSOoD8Oq2w/lyz8vw=="]}],"outputs":[{"shape":[6],"values":["fZQIP0+tL7/8MOO+CFmqPwKUZT/uUFi/"]}]}],"trainable_params":{"dense":{"weights":["zxeBOS3Ecjqk/xS6LmlMut4Xg7r11kC64n14OdmByro09E46y6+zur7pLLnvQWs6aLR1ugv3EzlKbqa6skvZOuf8ajpkJcK4lHyquRXpjrph8VA6NgyeOrn45rqw3ky2pIDBuBiJ87udC8o6lLwCu0P3ljo0fRc6K0A5Pd7GEb3N0pO8azNkPdR/SLy5vP08IyblvKPhGbyZyRO6guALPeKdSb0uwR89qXcuvYCisTzXiz89GgjHPGA/xjtPcic9uL9AvLPRbzwMdqg8P8YKvZmn4jy6/oM8ahYOPedUBb0E2IG8wgAQPG7ivzwWFQC9cTqxuWoxzDqkXJg4kBN2NwKnsTme5fI5n00VOlTlSbpQJFa4/LyPuqNaszp0KQU4KhpsOTNrv7kCPEY5lQXUuXYkCTmosnq5uaEquoxTADo7K127Jthlui3rkbnCO/I5rn+dueLE3Tl41s84qBfZunNxljqK30i66LF+uQUawzmyUks6/6yWuprKijlsx6068nmkOdMjKTtRXz85NDXIuruGJz3KFqE8ybytvMQAHb1NEMW8jl39u+RYQT14+4K6ywWIO6KDKj1NhGo92G6avNpXmLz51Hy8h0qEvNFWwrwSCBE84C2AO9ahDbxSm7I833PEO7xonbvrl447nTSyOwrUxLv263O6phT1Osa5m7t5r1e8YZAbPFyZw7xWuOg8jkpUPOBLzrrgZz29MKc6vOTh6rwEwq08zNSQPHw0jzocO345W8+NvM6TFr2hcf08vEm5vLGd5rxquNS88m5Xu7yxVr1Alxy9ODWWOwwKLLzdTkI9hXFaO+ThCT0qhRM7CaAuvA9mMrwQUO68aJD4PA=="],"bias":["LXCUvcvNuTxIr0U9he3qPLThZj1tKEI9gzxRPbHcZj1cubM9nV1nPQ=="]},"dense_1":{"weights":["5ZiYwFkBwEDQ4eO9RIQAwYN/ZsCU3E3A/pRpQO+Y9MDIX4RAx3ICQUvTnz/vWSZApxvMP7Q8n0DNTkzAp2KPQEo2aL8QB/hAkFy9wPXxXsB4Udy/4IaaQIYoQMBHNrTAlirRPyTSxcBsZ8fA7vcvwNYFSL/3hw5B4F9kwBu6Oj851spAg6euwJ4PnsAO8irAZuRhQEL1qUD6/2Y/JsjhwBo8EsCPS66+8tE3QD4aJMAJTnDAuOOYQI18R0DUFQhA+A1ywJaGKr+neF3AZCQtQFgoAsGOlbXAP1hNwAy5DcD4zuxALeHwP99OrMCV97ZA"],"bias":["oGqNPg+3FD9o3cw8NgYGv0Dqtz9MYw6/"]}},"hash":"f31dae9ab338932c442b67436ea3fcb7b164725b2b4b57c6ed53371509b1e08d"}